---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures
source: html/71d7fc5d-3316-52bf-2c92-fce823fc046a.htm
---
# BuiltInFailures.MEPFabricationFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.